test/zoo/basic/exported/basic_0_erd_crow.gv
// Generated by Mocodo 4.0.0

digraph{
  layout=dot
  bgcolor="#FFFFFF"
  nodesep=0.5

  // Nodes
  node [
      shape=none
      fontcolor="#000000"
      fontsize=15
      fontname="Helvetica"
]
  node [
      shape=none
      fontcolor="#000000"
      fontsize=15
      fontname="Helvetica"
]
  1 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >CLIENT</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">Réf. client</td></tr>
        <tr><td> </td><td align="left">Nom</td></tr>
        <tr><td> </td><td align="left">Prénom</td></tr>
        <tr><td> </td><td align="left">Adresse</td></tr>
    </table>
>]
  2 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >COMMANDE</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">Num. commande</td></tr>
        <tr><td> </td><td align="left">Date</td></tr>
        <tr><td> </td><td align="left">Montant</td></tr>
    </table>
>]
  3 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >INCLURE</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">Quantité</td></tr>
    </table>
>]
  4 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >PRODUIT</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">Réf. produit</td></tr>
        <tr><td> </td><td align="left">Libellé</td></tr>
        <tr><td> </td><td align="left">Prix unitaire</td></tr>
    </table>
>]

  // Edges
  edge [
    penwidth=1
    color="#000000"
    fontcolor="#000000"
    fontname="Futura"
    fontsize=11
    dir=both
  ]
  1 -> 2 [arrowhead="crowodot" arrowtail="teetee" label="DF"]
  3 -> 2 [arrowhead="teetee" arrowtail="crowtee" label="DF" style=dotted]
  3 -> 4 [arrowhead="teetee" arrowtail="crowodot" label="DF" style=dotted]
}
