test/zoo/basic/exported/basic_0_erd_crow.mmd
erDiagram
  %% Generated by Mocodo 4.0.1
  CLIENT {
    TYPE ref_client PK
    TYPE nom
    TYPE prenom
    TYPE adresse
  }
  COMMANDE {
    TYPE num_commande PK
    TYPE date
    TYPE montant
  }
  INCLURE {
    TYPE quantite PK
  }
  PRODUIT {
    TYPE ref_produit PK
    TYPE libelle
    TYPE prix_unitaire
  }
  CLIENT ||--o{ COMMANDE: DF
  INCLURE }|..|| COMMANDE: DF
  INCLURE }o..|| PRODUIT: DF
